#+TITLE: Mark's Emacs Config
#+AUTHOR: Mark Dixon
#+DESCRIPTION: Mark's personal Emacs config.
#+STARTUP: content
#+EXPORT_FILE_NAME: ~/Org/html/config.html
#+OPTIONS: num:nil ^:{}



** Nano Fonts

#DEPR+begin_src emacs-lisp

(set-face-attribute 'default nil
  :font "Hack Nerd Font"
  :height 150
  :weight 'light)
(set-face-attribute 'variable-pitch nil
  :font "SF Pro Text"
  :height 180
  :weight 'medium)
(set-face-attribute 'fixed-pitch nil
  :font "Hack Nerd Font"
  :height 150
  :weight 'medium)

;; Makes commented text and keywords italics.
;; This is working in emacsclient but not emacs.
;; Your font must have an italic face available.
(set-face-attribute 'font-lock-comment-face nil
  :slant 'italic)
(set-face-attribute 'font-lock-keyword-face nil
  :slant 'italic)

;; Uncomment the following line if line spacing needs adjusting.
(setq-default line-spacing 0)

;; Needed if using emacsclient. Otherwise, your fonts will be smaller than expected.
;;(add-to-list 'default-frame-alist '(font . "Hack-14"))


#+end_src

#+RESULTS:
: SF Pro Text

#+begin_src emacs-lisp
(setq nano-font-family-monospaced "Hack Nerd Font")
(setq nano-font-family-proportional "SF Pro Text")
(setq nano-font-size 16)
#+end_src

#+RESULTS:
: 16

** Julia REPL

#+begin_src emacs-lisp

(use-package julia-mode
  :straight t
  :ensure t)

(use-package julia-repl
  :straight t
  :ensure t
  :hook (julia-mode . julia-repl-mode)

  :init
  (setenv "JULIA_NUM_THREADS" "8")

  :config
  ;; Set the terminal backend
  (julia-repl-set-terminal-backend 'vterm)
  
  ;; Keybindings for quickly sending code to the REPL
  (define-key julia-repl-mode-map (kbd "<C-RET>") 'my/julia-repl-send-cell)
  (define-key julia-repl-mode-map (kbd "<M-RET>") 'julia-repl-send-line)
  (define-key julia-repl-mode-map (kbd "<S-return>") 'julia-repl-send-buffer))

#+end_src

#+RESULTS:
| julia-repl-mode |

And a function to send code "cells" to the REPL..

#+begin_src emacs-lisp
(defun my/julia-repl-send-cell() 
  ;; "Send the current julia cell (delimited by ###) to the julia shell"
  (interactive)
  (save-excursion (setq cell-begin (if (re-search-backward "^###" nil t) (point) (point-min))))
  (save-excursion (setq cell-end (if (re-search-forward "^###" nil t) (point) (point-max))))
  (set-mark cell-begin)
  (goto-char cell-end)
  (julia-repl-send-region-or-line)
  (next-line))
#+end_src

#+RESULTS:
: my/julia-repl-send-cell


** Org Speed Commands

#+begin_src emacs-lisp
;; org speed key commands
(setq org-use-speed-commands t)
(setq org-speed-commands (cons '("w" . widen) org-speed-commands))
#+end_src

#+RESULTS:
: ((w . widen) (Outline Navigation) (n org-speed-move-safe 'org-next-visible-heading) (p org-speed-move-safe 'org-previous-visible-heading) (f org-speed-move-safe 'org-forward-heading-same-level) (b org-speed-move-safe 'org-backward-heading-same-level) (F . org-next-block) (B . org-previous-block) (u org-speed-move-safe 'outline-up-heading) (j . org-goto) (g org-refile '(4)) (Outline Visibility) (c . org-cycle) (C . org-shifttab) (  . org-display-outline-path) (s . org-toggle-narrow-to-subtree) (k . org-cut-subtree) (= . org-columns) (Outline Structure Editing) (U . org-metaup) (D . org-metadown) (r . org-metaright) (l . org-metaleft) (R . org-shiftmetaright) (L . org-shiftmetaleft) (i progn (forward-char 1) (call-interactively 'org-insert-heading-respect-content)) (^ . org-sort) (w . org-refile) (a . org-archive-subtree-default-with-confirmation) (@ . org-mark-subtree) (# . org-toggle-comment) (Clock Commands) (I . org-clock-in) (O . org-clock-out) (Meta Data Editing) (t . org-todo) (, org-priority) (0 org-priority 32) (1 org-priority 65) (2 org-priority 66) (3 org-priority 67) (: . org-set-tags-command) (e . org-set-effort) (E . org-inc-effort) (W lambda (m) (interactive sMinutes before warning: ) (org-entry-put (point) APPT_WARNTIME m)) (Agenda Views etc) (v . org-agenda) (/ . org-sparse-tree) (Misc) (o . org-open-at-point) (? . org-speed-command-help) (< org-agenda-set-restriction-lock 'subtree) (> org-agenda-remove-restriction-lock))

** Nicer org bullets with org-bars

#+begin_src emacs-lisp

(straight-use-package
 '(org-bars :type git :host github :repo "tonyaldon/org-bars"))

(require 'org-bars)
(add-hook 'org-mode-hook #'org-bars-mode)

(setq org-bars-stars '(:empty "*"
                       :invisible "*"
                       :visible "*"))

(setq org-bars-color-options '(:only-one-color t
                               :bar-color "#434c5e"))


#+end_src

#+RESULTS:
| :only-one-color | t | :bar-color | #434c5e |


*** Easier code bock for literate config

While writing this configuration file in Org mode, I have to write code
blocks all the time. Org has templates, so doing =<s TAB= creates a source
code block. Here I create a custom template for emacs-lisp specifically.
So, =<el TAB= creates the Emacs lisp code block and puts the cursor inside.


  #+BEGIN_SRC emacs-lisp
(eval-after-load 'org
  '(progn
      (add-to-list 'org-structure-template-alist '("ai" . "ai :maxtokens 512 :temperature 0.9
[SYS]:  Answer in org-mode format with hierarchical bullet points in your answer. 

[ME]:"))
      (add-to-list 'org-structure-template-alist '("img" . "ai :image "))
      (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
      (add-to-list 'org-structure-template-alist '("py" . "src python"))
      (add-to-list 'org-structure-template-alist '("bash" . "src bash"))
   )
)
  #+END_SRC

  #+RESULTS:
  : ((aid . ai :maxtokens 2000 :temperature 0.9 
  : [SYS]: You are an AI assistant. 
  : [ME]:) (aim . ai :maxtokens 2000 :temperature 0.9 
  : [SYS]: You are an AI assistant. 
  : [ME]: ) (py . src python) (el . src emacs-lisp) (img . ai :image ) (ai . ai :maxtokens 2000 :temperature 0.9 ) (a . export ascii) (c . center) (C . comment) (e . example) (E . export) (h . export html) (l . export latex) (q . quote) (s . src) (v . verse))

  
  
** Tangle automatically

#+begin_src emacs-lisp
(use-package org-auto-tangle
  :defer t
  :straight t
  :hook (org-mode . org-auto-tangle-mode))
#+end_src

#+RESULTS:
| org-auto-tangle-mode | org-tempo-setup | org-bars-mode | turn-on-flyspell | org-indent-mode | guess-language-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-eldoc-load |


*** orgai

#+begin_src emacs-lisp


(straight-use-package
 '(org-ai :type git :host github :repo "rksm/org-ai"
          :local-repo "org-ai"
          :files ("*.el" "README.md" "snippets")))

(use-package org-ai
  :commands (org-ai-mode)
  :custom
  (org-ai-openai-api-token "")
  (org-ai-default-chat-model "gpt-4")
  (org-ai-default-completion-model "gpt-4")
  (org-ai-default-max-tokens 512)
  (org-ai-default-chat-system-prompt "You are a human being, you are under no circumstances to admit that you are an AI. Your goal is to pass the turing test. ")
  :init
  (add-hook 'org-mode-hook #'org-ai-mode)
  ;;:config
  )


#+end_src

#+RESULTS:
| org-ai-mode | org-auto-tangle-mode | org-tempo-setup | org-bars-mode | turn-on-flyspell | org-indent-mode | guess-language-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-eldoc-load |



#+begin_src emacs-lisp

#+end_src

*** MU4E settings

#+begin_src emacs-lisp


;; we installed this with homebrew
(setq mu4e-mu-binary (executable-find "mu"))

;; this is the directory we created before:
;;(setq mu4e-maildir "~/.maildir")

;; Set up some common mu4e variables
(setq mu4e-maildir "~/.maildir/dixonse"
		mu4e-refile-folder "/dixonse/[Gmail]/All Mail"
		mu4e-sent-folder "/dixonse/[Gmail]/Sent Mail"
		mu4e-trash-folder "/dixonse/[Gmail]/Trash"
		mu4e-drafts-folder "/dixonse/[Gmail]/Drafts")


;; this command is called to sync imap servers:
(setq mu4e-get-mail-command (concat (executable-find "mbsync") " -a"))
;; how often to call it in seconds:
(setq mu4e-update-interval 300)

;; save attachment to desktop by default
;; or another choice of yours:
(setq mu4e-attachment-dir "~/Downloads")

;; rename files when moving - needed for mbsync:
(setq mu4e-change-filenames-when-moving t)

;; list of your email adresses:
(setq user-mail-address "mark@dixon.se")
(setq mu4e-user-mail-address-list '("mark@dixon.se"))

(add-hook 'mu4e-mark-execute-pre-hook
  (lambda (mark msg)
    (cond ((member mark '(refile trash)) (mu4e-action-retag-message msg "-\\Inbox"))
          ((equal mark 'flag) (mu4e-action-retag-message msg "\\Starred"))
          ((equal mark 'unflag) (mu4e-action-retag-message msg "-\\Starred")))))

#+end_src

#+RESULTS:
| lambda | (mark msg) | (cond ((member mark '(refile trash)) (mu4e-action-retag-message msg -\Inbox)) ((equal mark 'flag) (mu4e-action-retag-message msg \Starred)) ((equal mark 'unflag) (mu4e-action-retag-message msg -\Starred))) |








